# "1st program"
print(9 ** 0.5 * 5)
# "2nd program"
print(9.99 > 9.98 and 1000.0 != 1000.1)
# "3rd program"
print(2 * 2 + 2)
print(2 * (2 + 2))
print((2 * 2 + 2) == (2 * (2 + 2)))
# "4th program"
a = '123.456'
print(a[4])
print(float(a))
print(float(a) * 10)
print(int(float(a) * 10))
print(int(float(a) * 10)%10)

# Лекция. Решение к практическому заданию по теме "Базовые структуры данных"
# Решение к практическому заданию по теме "Базовые структуры данных"
# Задача 1 (просто) "Арифметика":
#
# Решение:
# print(9 ** 0.5 * 5)
# Задача 2 (просто) "Логика":
#
# Решение:
# print(9.99 > 9.98 and 1000 != 1000.1)
# Задача 3 (средне) «Школьная загадка»:
#
# Решение:
# print(2 * 2 + 2)
# print(2 * (2 + 2))
# print(2 * 2 + 2 == 2 * (2 + 2))
# Задача 4 (сложно) "Первый после точки":
#
# Решение:
# print(int(float('123.456') * 10) % 10)
# В случае вопросов в выполнении следующих заданий можете обратиться к вашему куратору!
# Ваше решение может не совпадать с предложенным, главное - получить ответ, соблюдая условия задач.